; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 559906 1 3 4 3 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image2 - mode
	infrared1 - mode
	thermograph0 - mode
	image3 - mode
	Star0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(supports instrument1 image2)
	(calibration_target instrument1 Star1)
	(supports instrument2 image2)
	(supports instrument2 image3)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(have_image Star3 image3)
	(have_image Star4 thermograph0)
	(have_image Planet5 thermograph0)
	(have_image Planet6 thermograph0)
	(have_image Planet7 thermograph0)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 5
2. (turn_to satellite0 groundstation2 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 5
3. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 5
4. (turn_to satellite0 star4 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star4)
   goals met: 0 of 5
5. (turn_to satellite0 star3 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star3)
   goals met: 0 of 5
6. (take_image satellite0 star3 instrument2 image3)
   added: (have_image star3 image3)
   goals met: 1 of 5
7. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 1 of 5
8. (turn_to satellite0 star4 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star4)
   goals met: 1 of 5
9. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 5
10. (turn_to satellite0 star1 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star1)
   goals met: 1 of 5
11. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 1 of 5
12. (turn_to satellite0 star4 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star4)
   goals met: 1 of 5
13. (take_image satellite0 star4 instrument1 thermograph0)
   added: (have_image star4 thermograph0)
   goals met: 2 of 5
14. (turn_to satellite0 planet7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet7)
   goals met: 2 of 5
15. (take_image satellite0 planet7 instrument1 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 3 of 5
16. (turn_to satellite0 planet6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet6)
   goals met: 3 of 5
17. (take_image satellite0 planet6 instrument1 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 4 of 5
18. (turn_to satellite0 planet5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet5)
   goals met: 4 of 5
19. (take_image satellite0 planet5 instrument1 thermograph0)
   added: (have_image planet5 thermograph0)
   goals met: 5 of 5
